# 11. pandas基本介绍

In [3]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([1,3,6,np.nan, 41,55])

In [8]:
s

0     1.0
1     3.0
2     6.0
3     NaN
4    41.0
5    55.0
dtype: float64

In [11]:
dates = pd.date_range('20181216',periods=6)
dates

DatetimeIndex(['2018-12-16', '2018-12-17', '2018-12-18', '2018-12-19',
               '2018-12-20', '2018-12-21'],
              dtype='datetime64[ns]', freq='D')

In [14]:
a = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['a','b','c','d'])
a

                   a         b         c         d
2018-12-16  0.006602  0.667198 -0.639786  1.999210
2018-12-17  0.103610  1.226115  1.836339  1.584849
2018-12-18 -0.287295  0.514574  1.157590 -0.853395
2018-12-19 -0.327386  0.284607  0.781022 -0.950653
2018-12-20  1.991962 -0.959033 -0.263814  0.200146
2018-12-21 -1.548341 -0.178304  0.101719 -0.148921

In [19]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [42]:
df2 = pd.DataFrame({
    'A':1.,
    'B':pd.Timestamp('20131201'),
    'C':pd.Series(1, index=list(range(4)), dtype='float32'),
    'E':pd.Categorical(["test","train","test","train"]),
    'F':"foo"
})

df2

     A          B    C      E    F
0  1.0 2013-12-01  1.0   test  foo
1  1.0 2013-12-01  1.0  train  foo
2  1.0 2013-12-01  1.0   test  foo
3  1.0 2013-12-01  1.0  train  foo

In [26]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [28]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [32]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [33]:
df2.values

array([[1.0, Timestamp('2013-12-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-12-01 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-12-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-12-01 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [34]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [35]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-12-01 00:00:00,2013-12-01 00:00:00,2013-12-01 00:00:00,2013-12-01 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [38]:
df2.sort_index(axis=0, ascending=False)

     A          B    C  D      E    F
3  1.0 2013-12-01  1.0  3  train  foo
2  1.0 2013-12-01  1.0  3   test  foo
1  1.0 2013-12-01  1.0  3  train  foo
0  1.0 2013-12-01  1.0  3   test  foo

In [39]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-12-01  1.0
1  foo  train  3  1.0 2013-12-01  1.0
2  foo   test  3  1.0 2013-12-01  1.0
3  foo  train  3  1.0 2013-12-01  1.0

In [41]:
df2.sort_values(by='E')

     A          B    C  D      E    F
0  1.0 2013-12-01  1.0  3   test  foo
2  1.0 2013-12-01  1.0  3   test  foo
1  1.0 2013-12-01  1.0  3  train  foo
3  1.0 2013-12-01  1.0  3  train  foo